benchmark/report/rps/overload/20260804_182021/raw/003_health_c10000_r1.txt
Running 20s test @ http://127.0.0.1:32783/api/health
  8 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18s   914.43ms   4.99s    73.40%
    Req/Sec   176.34    142.02     1.26k    70.84%
  Latency Distribution
     50%    1.92s 
     75%    2.60s 
     90%    3.73s 
     99%    4.62s 
  24290 requests in 20.09s, 7.94MB read
  Socket errors: connect 0, read 332, write 0, timeout 566
  Non-2xx or 3xx responses: 18155
Requests/sec:   1209.13
Transfer/sec:    404.61KB
HPS_WRK_REQUESTS 24290
HPS_WRK_STATUS_ERRORS 18155
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 332
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 566
HPS_STATUS_TOTAL 24290
HPS_STATUS_2XX 6135
HPS_STATUS_NON_2XX 18155
HPS_STATUS_UNEXPECTED 18155
HPS_STATUS_CODES 200=6135,502=18155