benchmark/report/rps/overload/20260804_182021/raw/008_files_list_c5000_r1.txt
Running 20s test @ http://127.0.0.1:32783/api/files?offset=0&limit=20
  8 threads and 5000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.51s     1.44s    5.00s    57.84%
    Req/Sec    85.32     80.68   500.00     79.74%
  Latency Distribution
     50%    2.51s 
     75%    3.76s 
     90%    4.50s 
     99%    4.94s 
  7469 requests in 20.08s, 43.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 5600
Requests/sec:    371.92
Transfer/sec:      2.16MB
HPS_WRK_REQUESTS 7469
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 5600
HPS_STATUS_TOTAL 7469
HPS_STATUS_2XX 7469
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=7469